//напиши скрипт підрахунку суми зі знижкою в залежності
//від потраченої суми за весь період (партнерська програма)

//Загальна сума міститься в змінний tottlSpent
//Сума поточного платежу міститься в змінній payment
//Знижка міститься в змінній discount

//Якщо потрачено від [ 100 до 1000) - бронзовий партнер, знижка 2%
//Якщо потрачено від [ 1000 до 5000) - срібний партнер, знижка 5%
//Якщо потрачено більше [ 5000  - золотий партнер, знижка 10%
//Якщо потрачено менше 100) - не партнер, знижка 0%

//В результаті вивести повідомлення 
// "Здійснюється замовлення на суму [сума] зі знижкою [знижка]%"

let totalSpent = 6000;
let payment = 800;
let discount = 0;

//  if (totalSpent < 100) {
//     console.log(`не партнер, знижки немає`);
// } else if (totalSpent >= 100 && totalSpent < 1000) {
//     console.log(`бронзовий партнер, знижка 2%`);
//     discount = 0.02; 
// } else if (totalSpent >= 1000 && totalSpent < 5000) {
//     console.log(`срібний партнер, знижка 5%`);
//     discount = 0.05; 
// } else {
//     console.log(`золотий партнер, знижка 10%`);
//     discount = 0.1; 
// } 

  if (totalSpent >= 100 && totalSpent < 1000) {
    console.log(`бронзовий партнер, знижка 2%`);
    discount = 0.02; 
} else if (totalSpent >= 1000 && totalSpent < 5000) {
    console.log(`срібний партнер, знижка 5%`);
    discount = 0.05; 
} else if (totalSpent > 5000) {
    console.log(`золотий партнер, знижка 10%`);
    discount = 0.1; // відсотки в js мають такий вигляд, для коректного відображення множимо на 100
}  else  {
    console.log(`не партнер, знижки немає`);
  }
// вираховуєм суму потраченого зараз для загальної суми
// payment = payment - payment * discount;
payment -= payment * discount;

console.log(`Здійснюється замовлення на суму ${payment} зі знижкою ${discount * 100}%`); // discount множимо на 100

totalSpent += payment; // загальна сума потраченого, включно з поточною покупкою
console.log(`Загалом витрачено ${totalSpent} гривнів`);